tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
# Run your GitHub Actions locally 🚀
brew "act"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# GitHub command-line tool
brew "gh"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Cross-shell prompt for astronauts
brew "starship"
# Tool to build, change, and version infrastructure
brew "terraform"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# UNIX shell (command interpreter)
brew "zsh"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# App to build and share containerized applications and microservices
cask "docker"
# Web browser
cask "firefox"
# Screen color temperature controller
cask "flux"
cask "font-fira-code"
# Web browser
cask "google-chrome"
# HTTP and GraphQL Client
cask "insomnia"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Store credentials in a single place and log in on any device, even when offline
cask "nordpass"
# PHP IDE by JetBrains
cask "phpstorm"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# MySQL/MariaDB database management
cask "sequel-ace"
# Team communication and collaboration software
cask "slack"
# Open-source code editor
cask "visual-studio-code"
